Revit 2024 API
BuiltInFailures.DPartFailures Class
 Failures related to parts.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class DPartFailures
Visual Basic
Public NotInheritable Class DPartFailures
Visual C++
public ref class DPartFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.DPartFailures
See Also
BuiltInFailures.DPartFailures Members
Autodesk.Revit.DB Namespace